; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph0 - mode
	image2 - mode
	infrared1 - mode
	GroundStation1 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet3 - direction
	Planet4 - direction
	Planet5 - direction
	Planet6 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 132)
	(= (data Planet3 spectrograph0) 41)
	(= (data Planet4 spectrograph0) 104)
	(= (data Planet5 spectrograph0) 194)
	(= (data Planet6 spectrograph0) 43)
	(= (data Planet3 image2) 44)
	(= (data Planet4 image2) 63)
	(= (data Planet5 image2) 28)
	(= (data Planet6 image2) 79)
	(= (data Planet3 infrared1) 157)
	(= (data Planet4 infrared1) 41)
	(= (data Planet5 infrared1) 173)
	(= (data Planet6 infrared1) 86)
	(= (slew_time GroundStation1 Star0) 39.54)
	(= (slew_time Star0 GroundStation1) 39.54)
	(= (slew_time GroundStation2 Star0) 39.45)
	(= (slew_time Star0 GroundStation2) 39.45)
	(= (slew_time GroundStation2 GroundStation1) 14.06)
	(= (slew_time GroundStation1 GroundStation2) 14.06)
	(= (slew_time Planet3 Star0) 28.4)
	(= (slew_time Star0 Planet3) 28.4)
	(= (slew_time Planet3 GroundStation1) 21.65)
	(= (slew_time GroundStation1 Planet3) 21.65)
	(= (slew_time Planet3 GroundStation2) 13.54)
	(= (slew_time GroundStation2 Planet3) 13.54)
	(= (slew_time Planet4 Star0) 24.64)
	(= (slew_time Star0 Planet4) 24.64)
	(= (slew_time Planet4 GroundStation1) 8.253)
	(= (slew_time GroundStation1 Planet4) 8.253)
	(= (slew_time Planet4 GroundStation2) 1.832)
	(= (slew_time GroundStation2 Planet4) 1.832)
	(= (slew_time Planet4 Planet3) 2.629)
	(= (slew_time Planet3 Planet4) 2.629)
	(= (slew_time Planet5 Star0) 6.765)
	(= (slew_time Star0 Planet5) 6.765)
	(= (slew_time Planet5 GroundStation1) 58.54)
	(= (slew_time GroundStation1 Planet5) 58.54)
	(= (slew_time Planet5 GroundStation2) 42.95)
	(= (slew_time GroundStation2 Planet5) 42.95)
	(= (slew_time Planet5 Planet3) 41.82)
	(= (slew_time Planet3 Planet5) 41.82)
	(= (slew_time Planet5 Planet4) 50.26)
	(= (slew_time Planet4 Planet5) 50.26)
	(= (slew_time Planet6 Star0) 38.77)
	(= (slew_time Star0 Planet6) 38.77)
	(= (slew_time Planet6 GroundStation1) 32.83)
	(= (slew_time GroundStation1 Planet6) 32.83)
	(= (slew_time Planet6 GroundStation2) 18.3)
	(= (slew_time GroundStation2 Planet6) 18.3)
	(= (slew_time Planet6 Planet3) 34.75)
	(= (slew_time Planet3 Planet6) 34.75)
	(= (slew_time Planet6 Planet4) 60.32)
	(= (slew_time Planet4 Planet6) 60.32)
	(= (slew_time Planet6 Planet5) 41.02)
	(= (slew_time Planet5 Planet6) 41.02)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Planet5)
	(have_image Planet3 image2)
	(have_image Planet4 infrared1)
	(have_image Planet5 infrared1)
	(have_image Planet6 image2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 planet3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet3)
   changed: (fuel satellite0) from 132 to 97.25, (fuel-used) from 0 to 34.75
   goals met: 0 of 5
2. (turn_to satellite0 planet4 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 97.25 to 94.621, (fuel-used) from 34.75 to 37.379
   goals met: 0 of 5
3. (turn_to satellite0 groundstation2 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 94.621 to 92.789, (fuel-used) from 37.379 to 39.211
   goals met: 0 of 5
4. (turn_to satellite0 planet4 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 92.789 to 90.957, (fuel-used) from 39.211 to 41.043
   goals met: 0 of 5
5. (turn_to satellite0 planet3 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 planet3)
   changed: (fuel satellite0) from 90.957 to 88.328, (fuel-used) from 41.043 to 43.672
   goals met: 0 of 5
6. (turn_to satellite0 groundstation2 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 88.328 to 74.788, (fuel-used) from 43.672 to 57.212
   goals met: 0 of 5
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
8. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 5
9. (turn_to satellite0 planet4 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 74.788 to 72.956, (fuel-used) from 57.212 to 59.044
   goals met: 0 of 5
10. (turn_to satellite0 planet3 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 planet3)
   changed: (fuel satellite0) from 72.956 to 70.327, (fuel-used) from 59.044 to 61.673
   goals met: 0 of 5
11. (turn_to satellite0 planet4 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 70.327 to 67.698, (fuel-used) from 61.673 to 64.302
   goals met: 0 of 5
12. (turn_to satellite0 planet3 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 planet3)
   changed: (fuel satellite0) from 67.698 to 65.069, (fuel-used) from 64.302 to 66.931
   goals met: 0 of 5
13. (take_image satellite0 planet3 instrument1 image2)
   added: (have_image planet3 image2)
   changed: (data_capacity satellite0) from 1000 to 956, (data-stored) from 0 to 44
   goals met: 1 of 5
14. (turn_to satellite0 planet4 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 65.069 to 62.44, (fuel-used) from 66.931 to 69.56
   goals met: 1 of 5
15. (take_image satellite0 planet4 instrument1 infrared1)
   added: (have_image planet4 infrared1)
   changed: (data_capacity satellite0) from 956 to 915, (data-stored) from 44 to 85
   goals met: 2 of 5
16. (turn_to satellite0 groundstation2 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 62.44 to 60.608, (fuel-used) from 69.56 to 71.392
   goals met: 2 of 5
17. (turn_to satellite0 planet6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 60.608 to 42.308, (fuel-used) from 71.392 to 89.692
   goals met: 2 of 5
18. (take_image satellite0 planet6 instrument1 image2)
   added: (have_image planet6 image2)
   changed: (data_capacity satellite0) from 915 to 836, (data-stored) from 85 to 164
   goals met: 3 of 5
19. (turn_to satellite0 planet5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 42.308 to 1.288, (fuel-used) from 89.692 to 130.712
   goals met: 4 of 5
20. (take_image satellite0 planet5 instrument1 infrared1)
   added: (have_image planet5 infrared1)
   changed: (data_capacity satellite0) from 836 to 663, (data-stored) from 164 to 337
   goals met: 5 of 5
